# 上节课用剪切板创建dataframe,本次用字典和series创建

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

### 字典

In [4]:
data = {
    'Country':['china','india','brazil'],
    'Capital':['beijing','new delhi','brassilia'],
    'Population':['143200000','13210000','2300000']
}

In [6]:
df = DataFrame(data)
df

  Country    Capital Population
0   china    beijing  143200000
1   india  new delhi   13210000
2  brazil  brassilia    2300000

In [7]:
df = DataFrame(data,index=['A','B','C'])
df

  Country    Capital Population
A   china    beijing  143200000
B   india  new delhi   13210000
C  brazil  brassilia    2300000

In [8]:
df[0:1]

  Country  Capital Population
A   china  beijing  143200000

In [9]:
df.iloc[0:2,1:2]

     Capital
A    beijing
B  new delhi

In [16]:
df.loc[['A','B']]

  Country    Capital Population
A   china    beijing  143200000
B   india  new delhi   13210000

In [18]:
# Iterate over DataFrame rows as (index, Series) pairs.
for row in df.iterrows():
    print(row[0],row[1])
    break

A Country           china
Capital         beijing
Population    143200000
Name: A, dtype: object

### 用series创建

In [20]:
data

{'Country': ['china', 'india', 'brazil'],
 'Capital': ['beijing', 'new delhi', 'brassilia'],
 'Population': ['143200000', '13210000', '2300000']}

In [21]:
s1 = Series(data['Country'])
s2 = Series(data['Capital'])
s3 = Series(data['Population'])

In [24]:
df_new = DataFrame([s1,s2,s3])
df_new

           0          1          2
0      china      india     brazil
1    beijing  new delhi  brassilia
2  143200000   13210000    2300000

In [29]:
# 改造上面的df_new
# index
df_new = DataFrame([s1,s2,s3],index=['Country','Capital','Population'])
df_new

                    0          1          2
Country         china      india     brazil
Capital       beijing  new delhi  brassilia
Population  143200000   13210000    2300000

In [30]:
# 转置
df_new = df_new.T
df_new

  Country    Capital Population
0   china    beijing  143200000
1   india  new delhi   13210000
2  brazil  brassilia    2300000

In [32]:
df_new.index = ['A','B','C']
df_new

  Country    Capital Population
A   china    beijing  143200000
B   india  new delhi   13210000
C  brazil  brassilia    2300000